app/views/scores/show.html.erb

<% @gegner_name = @scores_all.where(game_id: @game.id).where.not(user_id: current_user.id).first.username  %>
<% if @game.scores.where.not(user_id: current_user.id).take.is_calculated == false %>
---
SELECT  "scores".* FROM "scores"  WHERE "scores"."game_id" = 3 AND ("scores"."user_id" != 5)  ORDER BY "scores"."id" ASC LIMIT 1

          </tr>
          <% @game.rounds.where(player_id: current_user.id).each do |round|  %>
---
SELECT "rounds".* FROM "rounds"  WHERE "rounds"."game_id" = ? AND ("rounds"."player_id" != 6)  [["game_id", 3]]