app/views/games/show.html.erb

SELECT COUNT(*) FROM "players"  WHERE "players"."game_id" = ?  [["game_id", 3]]
---
<p>
  <% if @game.players.count >= 2 %>