app/views/games/show.html.erb

SELECT "players".* FROM "players"  WHERE "players"."game_id" = ?  [["game_id", 2]]
---
        <tr><td>Spieler:</td></tr>
    <% @game.players.each do |player|  %>

SELECT  "rounds".* FROM "rounds"  WHERE "rounds"."game_id" = ? AND "rounds"."round_count" = 1 AND "rounds"."player_id" = 4  ORDER BY "rounds"."id" ASC LIMIT 1  [["game_id", 2]]
---
  <% if @game.ready >= 2 %>
      <%= button_to "Start!", round_path(@game.rounds.where(round_count: 1, player_id: current_user).first), :method => :get %>