app/controllers/games_controller.rb

SELECT "games".* FROM "games"  WHERE (ready < 2)
---
  def index
    @games = Game.where('ready < ?', 2)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 4  ORDER BY "users"."id" ASC LIMIT 1
SELECT  1 AS one FROM "players"  WHERE "players"."game_id" = ? AND "players"."id" = 4 LIMIT 1  [["game_id", 2]]
SELECT "players".* FROM "players"  WHERE "players"."game_id" = ?  [["game_id", 2]]
SELECT COUNT(*) FROM "players"  WHERE "players"."game_id" = ?  [["game_id", 2]]
INSERT INTO "players" ("created_at", "game_id", "id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-26 13:55:48.692021"], ["game_id", 2], ["id", 4], ["name", "TEST1"], ["updated_at", "2015-02-26 13:55:48.692021"]]
UPDATE "games" SET "ready" = ?, "updated_at" = ? WHERE "games"."id" = 2  [["ready", 1], ["updated_at", "2015-02-26 13:55:10.241763"]]
INSERT INTO "scores" ("created_at", "game_id", "is_calculated", "points", "updated_at", "user_id", "username") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2015-02-26 14:07:19.326276"], ["game_id", 3], ["is_calculated", "f"], ["points", 0], ["updated_at", "2015-02-26 14:07:19.326276"], ["user_id", 5], ["username", "Fritz"]]
SELECT  "rounds".* FROM "rounds"  WHERE "rounds"."game_id" = ? AND "rounds"."round_count" = 1 AND "rounds"."player_id" = 4  ORDER BY "rounds"."id" ASC LIMIT 1  [["game_id", 2]]
SELECT  1 AS one FROM "rounds"  WHERE "rounds"."game_id" = ? AND "rounds"."round_count" = 1 AND ("rounds"."player_id" != 5) LIMIT 1  [["game_id", 3]]
SELECT "scores".* FROM "scores"  WHERE "scores"."user_id" = ?  [["user_id", 5]]
INSERT INTO "rounds" ("character", "created_at", "game_id", "is_active", "player_id", "round_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["character", "X"], ["created_at", "2015-02-26 14:07:19.482608"], ["game_id", 3], ["is_active", "t"], ["player_id", 5], ["round_count", 1], ["updated_at", "2015-02-26 14:07:19.482608"]]
---
  def show
    user = User.find(current_user)
    if @game.players.exists?(user.id)
    else
      if @game.players.count >= 2
        redirect_to games_path,:notice => 'Spiel ist voll!'
      else
        @game.ready = @game.ready + 1
        @game.save
        @player = @game.players.create(id: user.id, name: user.username)
        @points = @game.scores.create(points: 0, user_id: user.id, username: user.username, is_calculated: false)

        i = 1
        @game.max_round_count.times {
          if @game.rounds.where(round_count: i).where.not(player_id: current_user.id).exists?
            char =  @game.rounds.where(round_count: i).where.not(player_id: current_user.id).take.character
          else
            char = CHARS[rand(26)]
          end
          @round = @game.rounds.create(character: char, round_count: i, is_active: true, player_id: @player.id)

INSERT INTO "games" ("created_at", "max_round_count", "name", "ready", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-26 13:14:05.498000"], ["max_round_count", 1], ["name", "Test"], ["ready", 0], ["updated_at", "2015-02-26 13:14:05.498000"]]
---
  def create
    @game = Game.new(game_params)
    @game.ready = 0
    #respond_to do |format|
      if @game.save