app/controllers/rounds_controller.rb

  def index
    @rounds = Round.all
---
SELECT "rounds".* FROM "rounds"

  def show
    if  @round.player_id!=User.find(current_user).id
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 6  ORDER BY "users"."id" ASC LIMIT 1

  def edit
    @round.city = round_params[:city]
    @round.country = round_params[:country]
    @round.river = round_params[:river]
    @round.is_active = false
    @round.save
    if @round.round_count < Game.find(@round.game_id).max_round_count
      @next_round = Round.find_by(game_id: @round.game_id, player_id: @round.player_id, round_count: @round.round_count + 1)
      redirect_to round_path(@next_round)
    else
      @score = Score.where(user_id: current_user, game_id: @round.game_id).take
      @player = Player.find(current_user)
      @player.delete
      @game = Game.find(@round.game_id)
      @game.ready = @game.ready + 1
      @game.save
---
UPDATE "rounds" SET "city" = ?, "country" = ?, "is_active" = ?, "river" = ?, "updated_at" = ? WHERE "rounds"."id" = 1  [["city", "x"], ["country", "x"], ["is_active", "f"], ["river", "x"], ["updated_at", "2015-02-26 14:08:40.628305"]]
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "rounds".* FROM "rounds"  WHERE "rounds"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "rounds".* FROM "rounds"  WHERE "rounds"."game_id" = 1 AND "rounds"."player_id" = 2 AND "rounds"."round_count" = 2 LIMIT 1
SELECT  "scores".* FROM "scores"  WHERE "scores"."user_id" = 5 AND "scores"."game_id" = 3 LIMIT 1
SELECT  "players".* FROM "players"  WHERE "players"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "players" WHERE "players"."id" = 5
UPDATE "games" SET "ready" = ?, "updated_at" = ? WHERE "games"."id" = 3  [["ready", 3], ["updated_at", "2015-02-26 14:08:41.183503"]]

  def create
    @round = Round.new(round_params)
    @game = Game.find(@round.game_id)
    if @game.rounds.where(round_count: @round.round_count).not(player_id: current_user.id).take.exists?
      o_round = @game.rounds.where(round_count: @round.round_count).not(player_id: current_user.id).take
      @round.character = o_round.character
    else
      @round.character = CHARS[rand(26)]
    end
    respond_to do |format|
      if @round.save
---
INSERT INTO "rounds" ("character", "city", "country", "created_at", "river", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["character", "sdsdas"], ["city", ""], ["country", ""], ["created_at", "2015-02-12 23:39:36.946998"], ["river", ""], ["updated_at", "2015-02-12 23:39:36.946998"]]

  def update
    respond_to do |format|
      if @round.update(round_params)
---
UPDATE "rounds" SET "character" = ?, "city" = ?, "country" = ?, "points" = ?, "river" = ?, "updated_at" = ? WHERE "rounds"."id" = 1  [["character", "A"], ["city", "Arnsberg"], ["country", "Albanien"], ["points", 200], ["river", "Am"], ["updated_at", "2015-02-12 23:40:12.021553"]]

  def destroy
    @round.destroy
---
DELETE FROM "rounds" WHERE "rounds"."id" = ?  [["id", 1]]

    def set_round
      if Round.exists?(id: params[:id])
        @round = Round.find(params[:id])
---
SELECT  "rounds".* FROM "rounds"  WHERE "rounds"."id" = ? LIMIT 1  [["id", 1]]