app/controllers/rundes_controller.rb

SELECT "rundes".* FROM "rundes"
---
  def index
    @rundes = Runde.all

SELECT  "rundes".* FROM "rundes"  WHERE "rundes"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_runde
      @runde = Runde.find(params[:id])