app/controllers/scores_controller.rb

SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 3]]
SELECT "rounds".* FROM "rounds"  WHERE "rounds"."game_id" = ? AND ("rounds"."player_id" != 6)  [["game_id", 3]]
SELECT  1 AS one FROM "cities"  WHERE "cities"."name" = 'xanten' LIMIT 1
---
  def show
    @game = Game.find(@score.game_id)
    @score.points = 0
    if @game.ready >= 4
      @own_rounds = @game.rounds.where(player_id: current_user.id).each
      @opponent_rounds = @game.rounds.where.not(player_id: current_user.id).each
      @own_rounds.each do |round|
        if round.city.present?
          if round.city[0].capitalize != round.character then
            @score.points = @score.points + 0
          else
            #Weiter prüfen:
            if Citie.exists?(name: round.city.downcase)

SELECT  1 AS one FROM "countries"  WHERE "countries"."name" = 'x' LIMIT 1
---
            @score.points = @score.points + 0
          else
            #Weiter prüfen:
            if Countrie.exists?(name: round.country.downcase)

SELECT  1 AS one FROM "rivers"  WHERE "rivers"."name" = 'x' LIMIT 1
---
            @score.points = @score.points + 0
          else
            #Weiter prüfen:
            if River.exists?(name: round.river.downcase)

UPDATE "scores" SET "is_calculated" = ?, "points" = ?, "updated_at" = ? WHERE "scores"."id" = 3  [["is_calculated", "t"], ["points", 25], ["updated_at", "2015-02-26 14:10:00.383185"]]
---
          #nichts, Punkte bleiben bei 0
        end
        @score.is_calculated = true
        @score.save