app/controllers/welcome_controller.rb

  def index
    redirect_to game_path(Game.find(Player.find(current_user).game_id)) if Player.exists?(current_user)
---
SELECT  "games".* FROM "games"  WHERE "games"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "players".* FROM "players"  WHERE "players"."id" = ? LIMIT 1  [["id", 4]]
SELECT  1 AS one FROM "players"  WHERE "players"."id" = 1 LIMIT 1